flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_btim.c
/**
  ******************************************************************************
  * @file    fm33g0xx_btim.c
  * @author  FM33g0xx Application Team
  * @version V0.3.00G
  * @date    08-31-2018
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of....:
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33g0xx_btim.h"  


/** @addtogroup fm33g0xx_StdPeriph_Driver
  * @{
  */

/** @defgroup BTIM 
  * @brief BTIM driver modules
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup BTIM_Private_Functions
  * @{
  */ 



/*********************************
basic timer高位计数器启动控制函数 
功能：BT高位计数器启停控制
输入: ENABLE 启动高位计数器
      DISABLE 停止高位计数器
      BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTCR1_CHEN_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTCR1 |= (BTIMx_BTCR1_CHEN_Msk);
	}
	else
	{
		BTIMx->BTCR1 &= ~(BTIMx_BTCR1_CHEN_Msk);
	}
}
/*********************************
basic timer高位计数器控制位状态获取函数 
功能：获取BT高位计数器启停控制状态
输入: BTIM1/BTIM2  定时器名称
输出: ENABLE 当前BT高位计数器已启动
      DISABLE 当前BT高位计数器已停止
*********************************/
FunState BTIMx_BTCR1_CHEN_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTCR1 & (BTIMx_BTCR1_CHEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer低位计数器启动控制函数 
功能：BT低位计数器启停控制
输入: ENABLE 启动低位计数器
      DISABLE 停止低位计数器
      BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTCR1_CLEN_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTCR1 |= (BTIMx_BTCR1_CLEN_Msk);
	}
	else
	{
		BTIMx->BTCR1 &= ~(BTIMx_BTCR1_CLEN_Msk);
	}
}
/*********************************
basic timer低位计数器控制位状态获取函数 
功能：获取BT低位计数器启停控制状态
输入: BTIM1/BTIM2  定时器名称
输出: ENABLE 当前BT低位计数器已启动
      DISABLE 当前BT低位计数器已停止
*********************************/
FunState BTIMx_BTCR1_CLEN_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTCR1 & (BTIMx_BTCR1_CLEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer工作模式配置函数 
功能：配置BT工作模式
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR1_MODE_8BITS_TIM_CNT/BTIMx_BTCR1_MODE_16BITS_CAP 8位/16位定时器      
输出: 无
*********************************/
void BTIMx_BTCR1_MODE_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR1;
	tmpreg &= ~(BTIMx_BTCR1_MODE_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR1_MODE_Msk);
	BTIMx->BTCR1 = tmpreg;
}
/*********************************
basic timer获取工作模式配置函数 
功能：获取BT工作模式
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR1_MODE_8BITS_TIM_CNT/BTIMx_BTCR1_MODE_16BITS_CAP 8位/16位定时器
*********************************/
uint32_t BTIMx_BTCR1_MODE_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR1 & BTIMx_BTCR1_MODE_Msk);
}

/*********************************
basic timer工作模式配置函数 
功能：配置BT的计数沿或捕捉沿
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR1_EDGESEL_POS/BTIMx_BTCR1_EDGESEL_NEG 计数沿或捕捉沿为上升沿/下降沿      
输出: 无
*********************************/
void BTIMx_BTCR1_EDGESEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR1;
	tmpreg &= ~(BTIMx_BTCR1_EDGESEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR1_EDGESEL_Msk);
	BTIMx->BTCR1 = tmpreg;
}
/*********************************
basic timer获取工作模式配置函数 
功能：获取BT的计数沿或捕捉沿具体方式
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR1_EDGESEL_POS/BTIMx_BTCR1_EDGESEL_NEG 计数沿或捕捉沿为上升沿/下降沿 
*********************************/
uint32_t BTIMx_BTCR1_EDGESEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR1 & BTIMx_BTCR1_EDGESEL_Msk);
}


/*********************************
basic timer工作模式配置函数 
功能：配置BT的捕捉模式控制（仅捕捉模式下有效）
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR1_CAPMOD_PAUSE_PERIOD/BTIMx_BTCR1_CAPMOD_PAUSE_WIDTH 脉冲周期捕捉/脉冲宽度捕捉
输出: 无
*********************************/
void BTIMx_BTCR1_CAPMOD_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR1;
	tmpreg &= ~(BTIMx_BTCR1_CAPMOD_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR1_CAPMOD_Msk);
	BTIMx->BTCR1 = tmpreg;
}
/*********************************
basic timer获取工作模式配置函数 
功能：获取BT的捕捉模式控制（仅捕捉模式下有效）配置
输入: BTIM1/BTIM2  定时器名称    
输出: BTIMx_BTCR1_CAPMOD_PAUSE_PERIOD/BTIMx_BTCR1_CAPMOD_PAUSE_WIDTH 脉冲周期捕捉/脉冲宽度捕捉
*********************************/
uint32_t BTIMx_BTCR1_CAPMOD_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR1 & BTIMx_BTCR1_CAPMOD_Msk);
}


/*********************************
basic timer工作模式配置函数 
功能：配置BT的带清零捕捉模式控制是否清零
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR1_CAPCLR_CAP_CNT_NO_CLR/BTIMx_BTCR1_CAPCLR_CAP_CNT_CLR  捕捉后计数器不清零/捕捉后计数器清零    
输出: 无
*********************************/
void BTIMx_BTCR1_CAPCLR_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR1;
	tmpreg &= ~(BTIMx_BTCR1_CAPCLR_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR1_CAPCLR_Msk);
	BTIMx->BTCR1 = tmpreg;
}
/*********************************
basic timer获取工作模式配置函数 
功能：获取BT的捕捉模式控制清零配置
输入: BTIM1/BTIM2  定时器名称    
输出: BTIMx_BTCR1_CAPCLR_CAP_CNT_NO_CLR/BTIMx_BTCR1_CAPCLR_CAP_CNT_CLR  捕捉后计数器不清零/捕捉后计数器清零    
*********************************/
uint32_t BTIMx_BTCR1_CAPCLR_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR1 & BTIMx_BTCR1_CAPCLR_Msk);
}

/*********************************
basic timer工作模式配置函数 
功能：配置BT是否单次捕捉
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR1_CAPONCE_CONTINUE/BTIMx_BTCR1_CAPONCE_SINGLE    连续捕捉/单次捕捉
输出: 无
*********************************/
void BTIMx_BTCR1_CAPONCE_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR1;
	tmpreg &= ~(BTIMx_BTCR1_CAPONCE_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR1_CAPONCE_Msk);
	BTIMx->BTCR1 = tmpreg;
}
/*********************************
basic timer工作模式配置函数 
功能：读BT配置捕捉方式
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR1_CAPONCE_CONTINUE/BTIMx_BTCR1_CAPONCE_SINGLE    连续捕捉/单次捕捉
*********************************/
uint32_t BTIMx_BTCR1_CAPONCE_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR1 & BTIMx_BTCR1_CAPONCE_Msk);
}

