flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_btim.c
/*********************************
basic timer输出模式配置函数 
功能：配置BT PWM输出是否有效
输入: BTIM1/BTIM2  定时器名称
      ENABLE/DISABLE   PWM输出模式有效/无效
输出: 无
*********************************/
void BTIMx_BTCR1_PWM_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTCR1 |= (BTIMx_BTCR1_PWM_Msk);
	}
	else
	{
		BTIMx->BTCR1 &= ~(BTIMx_BTCR1_PWM_Msk);
	}
}
/*********************************
basic timer输出模式配置函数 
功能：读BT配置 PWM输出是否有效
输入: BTIM1/BTIM2  定时器名称
输出: ENABLE/DISABLE   PWM输出模式有效/无效
*********************************/
FunState BTIMx_BTCR1_PWM_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTCR1 & (BTIMx_BTCR1_PWM_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer计数器内部计数源信号选择配置函数 
功能：配置BT 计数器内部计数源信号选择
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR2_SIG2SEL_GROUP1/BTIMx_BTCR2_SIG2SEL_GROUP2 内部计数源选择Group1/Group2
输出: 无
*********************************/
void BTIMx_BTCR2_SIG2SEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR2;
	tmpreg &= ~(BTIMx_BTCR2_SIG2SEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR2_SIG2SEL_Msk);
	BTIMx->BTCR2 = tmpreg;
}
/*********************************
basic timer计数器内部计数源信号选择配置函数
功能：获取BT计数器内部计数源信号选择
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR2_SIG2SEL_GROUP1/BTIMx_BTCR2_SIG2SEL_GROUP2 内部计数源选择Group1/Group2
*********************************/
uint32_t BTIMx_BTCR2_SIG2SEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR2 & BTIMx_BTCR2_SIG2SEL_Msk);
}

/*********************************
basic timer计数器内部捕捉源信号选择配置函数 
功能：配置BT 计数器内部捕捉源信号选择
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR2_SIG1SEL_GROUP1/BTIMx_BTCR2_SIG1SEL_GROUP2 内部捕捉源选择Group1/Group2
输出: 无
*********************************/
void BTIMx_BTCR2_SIG1SEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR2;
	tmpreg &= ~(BTIMx_BTCR2_SIG1SEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR2_SIG1SEL_Msk);
	BTIMx->BTCR2 = tmpreg;
}
/*********************************
basic timer计数器内部捕捉源信号选择配置函数
功能：获取BT计数器内部捕捉源信号选择
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR2_SIG1SEL_GROUP1/BTIMx_BTCR2_SIG1SEL_GROUP2 内部捕捉源选择Group1/Group2
*********************************/
uint32_t BTIMx_BTCR2_SIG1SEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR2 & BTIMx_BTCR2_SIG1SEL_Msk);
}

/*********************************
basic timer计数器高位计数器源选择配置函数 
功能：配置BT 高位计数器源选择
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR2_CNTHSEL_CNTL/BTIMx_BTCR2_CNTHSEL_CAPSRC/BTIMx_BTCR2_CNTHSEL_CNTSRC_DIR 与低位计数器组成16位计数器/选择内部捕捉信号源/选择内部计数信号源或外部DIR输入组合
输出: 无
*********************************/
void BTIMx_BTCR2_CNTHSEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR2;
	tmpreg &= ~(BTIMx_BTCR2_CNTHSEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR2_CNTHSEL_Msk);
	BTIMx->BTCR2 = tmpreg;
}
/*********************************
basic timer计数器高位计数器源选择配置函数
功能：获取BT计数器高位计数器源选择
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR2_CNTHSEL_CNTL/BTIMx_BTCR2_CNTHSEL_CAPSRC/BTIMx_BTCR2_CNTHSEL_CNTSRC_DIR 与低位计数器组成16位计数器/选择内部捕捉信号源/选择内部计数信号源或外部DIR输入组合
*********************************/
uint32_t BTIMx_BTCR2_CNTHSEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR2 & BTIMx_BTCR2_CNTHSEL_Msk);
}

/*********************************
basic timer计数器外部输入DIR控制配置函数 
功能：配置BT 外部输入DIR控制
输入: BTIM1/BTIM2  定时器名称
      ENABLE/DISABLE	外部输入DIR控制有效/无效
输出: 无
*********************************/
void BTIMx_BTCR2_DIREN_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTCR2 |= (BTIMx_BTCR2_DIREN_Msk);
	}
	else
	{
		BTIMx->BTCR2 &= ~(BTIMx_BTCR2_DIREN_Msk);
	}
}
/*********************************
basic timer计数器外部输入DIR控制配置函数 
功能：获取BT外部输入DIR控制状态
输入: BTIM1/BTIM2  定时器名称
输出: NABLE/DISABLE	外部输入DIR控制有效/无效
*********************************/
FunState BTIMx_BTCR2_DIREN_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTCR2 & (BTIMx_BTCR2_DIREN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer计数器内部输入DIR控制配置函数 
功能：配置BT 内部输入DIR控制
输入: BTIM1/BTIM2  定时器名称
      ENABLE/DISABLE	内部输入DIR控制有效/无效
输出: 无
*********************************/
void BTIMx_BTCR2_STDIR_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTCR2 |= (BTIMx_BTCR2_STDIR_Msk);
	}
	else
	{
		BTIMx->BTCR2 &= ~(BTIMx_BTCR2_STDIR_Msk);
	}
}
/*********************************
basic timer计数器内部输入DIR控制配置函数 
功能：获取BT内部输入DIR控制状态
输入: BTIM1/BTIM2  定时器名称
输出: NABLE/DISABLE	内部输入DIR控制有效/无效
*********************************/
FunState BTIMx_BTCR2_STDIR_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTCR2 & (BTIMx_BTCR2_STDIR_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer低位计数器控制函数 
功能：配置BT 低位计数器使能控制选择信号
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR2_SRCSEL_STDIR_EXSIG2/BTIMx_BTCR2_SRCSEL_WITHOUT_DIR	低位计数器由STDIR或外部EX_SIG2输入控制/低位计数器不受DIR控制
输出: 无
*********************************/
void BTIMx_BTCR2_SRCSEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR2;
	tmpreg &= ~(BTIMx_BTCR2_SRCSEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR2_SRCSEL_Msk);
	BTIMx->BTCR2 = tmpreg;
}

/*********************************
basic timer低位计数器控制函数 
功能：获取BT低位计数器使能控制选择信号
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR2_SRCSEL_STDIR_EXSIG2/BTIMx_BTCR2_SRCSEL_WITHOUT_DIR	低位计数器由STDIR或外部EX_SIG2输入控制/低位计数器不受DIR控制
*********************************/
uint32_t BTIMx_BTCR2_SRCSEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR2 & BTIMx_BTCR2_SRCSEL_Msk);
}

/*********************************
basic timer输入信号2控制函数 
功能：配置BT 输入信号2极性
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCR2_DIRPO_NO_ANTI/BTIMx_BTCR2_DIRPO_ANTI	对外部输入DIR信号不反向/对外部输入DIR信号取反向
输出: 无
*********************************/
void BTIMx_BTCR2_DIRPO_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCR2;
	tmpreg &= ~(BTIMx_BTCR2_DIRPO_Msk);
	tmpreg |= (SetValue & BTIMx_BTCR2_DIRPO_Msk);
	BTIMx->BTCR2 = tmpreg;
}
/*********************************
basic timer输入信号2控制函数 
功能：获取BT输入信号2极性
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCR2_DIRPO_NO_ANTI/BTIMx_BTCR2_DIRPO_ANTI	对外部输入DIR信号不反向/对外部输入DIR信号取反向
*********************************/
uint32_t BTIMx_BTCR2_DIRPO_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCR2 & BTIMx_BTCR2_DIRPO_Msk);
}

