flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_btim.c
/*********************************
basic timer RTCOUT2信号源选择函数 
功能：配置BT RTCOUT2信号源
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG1_RTCSEL2_RTC_32768/	RTC模块输出的32768Hz信号
      BTIMx_BTCFG1_RTCSEL2_RTC_SEC/	RTC模块输出的秒信号
      BTIMx_BTCFG1_RTCSEL2_RTC_MIN/	RTC模块输出的分信号
      BTIMx_BTCFG1_RTCSEL2_LPTIM_OUT	LPTIM模块输出的信号
输出: 无
*********************************/
void BTIMx_BTCFG1_RTCSEL2_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG1;
	tmpreg &= ~(BTIMx_BTCFG1_RTCSEL2_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG1_RTCSEL2_Msk);
	BTIMx->BTCFG1 = tmpreg;
}
/*********************************
basic timer RTCOUT2信号源选择函数 
功能：获取BT RTCOUT2信号源配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG1_RTCSEL2_RTC_32768/	RTC模块输出的32768Hz信号
      BTIMx_BTCFG1_RTCSEL2_RTC_SEC/	RTC模块输出的秒信号
      BTIMx_BTCFG1_RTCSEL2_RTC_MIN/	RTC模块输出的分信号
      BTIMx_BTCFG1_RTCSEL2_LPTIM_OUT	LPTIM模块输出的信号
*********************************/
uint32_t BTIMx_BTCFG1_RTCSEL2_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG1 & BTIMx_BTCFG1_RTCSEL2_Msk);
}


/*********************************
basic timer RTCOUT1信号源选择函数 
功能：配置BT RTCOUT1信号源
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG1_RTCSEL1_RTC_32768/	RTC模块输出的32768Hz信号
      BTIMx_BTCFG1_RTCSEL1_RTC_SEC/	RTC模块输出的秒信号
      BTIMx_BTCFG1_RTCSEL1_RTC_MIN/	RTC模块输出的分信号
      BTIMx_BTCFG1_RTCSEL1_LPTIM_OUT	LPTIM模块输出的信号
输出: 无
*********************************/
void BTIMx_BTCFG1_RTCSEL1_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG1;
	tmpreg &= ~(BTIMx_BTCFG1_RTCSEL1_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG1_RTCSEL1_Msk);
	BTIMx->BTCFG1 = tmpreg;
}
/*********************************
basic timer RTCOUT1信号源选择函数  
功能：获取BT RTCOUT1信号源配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG1_RTCSEL1_RTC_32768/	RTC模块输出的32768Hz信号
      BTIMx_BTCFG1_RTCSEL1_RTC_SEC/	RTC模块输出的秒信号
      BTIMx_BTCFG1_RTCSEL1_RTC_MIN/	RTC模块输出的分信号
      BTIMx_BTCFG1_RTCSEL1_LPTIM_OUT	LPTIM模块输出的信号
*********************************/
uint32_t BTIMx_BTCFG1_RTCSEL1_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG1 & BTIMx_BTCFG1_RTCSEL1_Msk);
}

/*********************************
basic timer Group2信号源选择函数 
功能：配置BT Group2信号源
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG1_GRP2SEL_APBCLK/	系统时钟APBCLK
      BTIMx_BTCFG1_GRP2SEL_RTCOUT2/	RTC时钟RTCOUT2
      BTIMx_BTCFG1_GRP2SEL_IN_SIG2/	内部输入信号2
      BTIMx_BTCFG1_GRP2SEL_EX_SIG2	外部输入信号2
输出: 无
*********************************/
void BTIMx_BTCFG1_GRP2SEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG1;
	tmpreg &= ~(BTIMx_BTCFG1_GRP2SEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG1_GRP2SEL_Msk);
	BTIMx->BTCFG1 = tmpreg;
}
/*********************************
basic timer Group2信号源选择函数
功能：获取BT Group2信号源配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG1_GRP2SEL_APBCLK/	系统时钟APBCLK
      BTIMx_BTCFG1_GRP2SEL_RTCOUT2/	RTC时钟RTCOUT2
      BTIMx_BTCFG1_GRP2SEL_IN_SIG2/	内部输入信号2
      BTIMx_BTCFG1_GRP2SEL_EX_SIG2	外部输入信号2
*********************************/
uint32_t BTIMx_BTCFG1_GRP2SEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG1 & BTIMx_BTCFG1_GRP2SEL_Msk);
}
/*********************************
basic timer Group1信号源选择函数 
功能：配置BT Group1信号源
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG1_GRP1SEL_APBCLK/	系统时钟APBCLK
      BTIMx_BTCFG1_GRP1SEL_RTCOUT2/	RTC时钟RTCOUT2
      BTIMx_BTCFG1_GRP1SEL_IN_SIG2/	内部输入信号2
      BTIMx_BTCFG1_GRP1SEL_EX_SIG2	外部输入信号2
输出: 无
*********************************/
void BTIMx_BTCFG1_GRP1SEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG1;
	tmpreg &= ~(BTIMx_BTCFG1_GRP1SEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG1_GRP1SEL_Msk);
	BTIMx->BTCFG1 = tmpreg;
}
/*********************************
basic timer Group1信号源选择函数
功能：获取BT Group1信号源配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG1_GRP1SEL_APBCLK/	系统时钟APBCLK
      BTIMx_BTCFG1_GRP1SEL_RTCOUT2/	RTC时钟RTCOUT2
      BTIMx_BTCFG1_GRP1SEL_IN_SIG2/	内部输入信号2
      BTIMx_BTCFG1_GRP1SEL_EX_SIG2	外部输入信号2
*********************************/
uint32_t BTIMx_BTCFG1_GRP1SEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG1 & BTIMx_BTCFG1_GRP1SEL_Msk);
}


/*********************************
basic timer 外部输入信号源2选择函数 
功能：配置BT 外部输入信号源2
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG2_EXSEL2_BT_IN0	外部输入1
      BTIMx_BTCFG2_EXSEL2_BT_IN1	外部输入2
      BTIMx_BTCFG2_EXSEL2_BT_IN2	外部输入3
      BTIMx_BTCFG2_EXSEL2_BT_IN3	外部输入4
输出: 无
*********************************/
void BTIMx_BTCFG2_EXSEL2_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG2;
	tmpreg &= ~(BTIMx_BTCFG2_EXSEL2_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG2_EXSEL2_Msk);
	BTIMx->BTCFG2 = tmpreg;
}
/*********************************
basic timer 外部输入信号源2选择函数 
功能：获取BT 外部输入信号源2配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG2_EXSEL2_BT_IN0	外部输入1
      BTIMx_BTCFG2_EXSEL2_BT_IN1	外部输入2
      BTIMx_BTCFG2_EXSEL2_BT_IN2	外部输入3
      BTIMx_BTCFG2_EXSEL2_BT_IN3	外部输入4
*********************************/
uint32_t BTIMx_BTCFG2_EXSEL2_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG2 & BTIMx_BTCFG2_EXSEL2_Msk);
}

/*********************************
basic timer 外部输入信号源1选择函数 
功能：配置BT 外部输入信号源1
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG2_EXSEL1_BT_IN0	外部输入1
      BTIMx_BTCFG2_EXSEL1_BT_IN1	外部输入2
      BTIMx_BTCFG2_EXSEL1_BT_IN2	外部输入3
      BTIMx_BTCFG2_EXSEL1_BT_IN3	外部输入4
输出: 无
*********************************/
void BTIMx_BTCFG2_EXSEL1_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG2;
	tmpreg &= ~(BTIMx_BTCFG2_EXSEL1_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG2_EXSEL1_Msk);
	BTIMx->BTCFG2 = tmpreg;
}
/*********************************
basic timer 外部输入信号源1选择函数 
功能：获取BT 外部输入信号源1配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG2_EXSEL1_BT_IN0	外部输入1
      BTIMx_BTCFG2_EXSEL1_BT_IN1	外部输入2
      BTIMx_BTCFG2_EXSEL1_BT_IN2	外部输入3
      BTIMx_BTCFG2_EXSEL1_BT_IN3	外部输入4
*********************************/
uint32_t BTIMx_BTCFG2_EXSEL1_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG2 & BTIMx_BTCFG2_EXSEL1_Msk);
}

/*********************************
basic timer 内部输入信号源2选择函数 
功能：配置BT 内部输入信号源2
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG2_INSEL2_UART_RX3	选择UART3接收信号做信号源
      BTIMx_BTCFG2_INSEL2_UART_RX4	选择UART4接收信号做信号源
      BTIMx_BTCFG2_INSEL2_UART_RX5	选择UART5接收信号做信号源
      BTIMx_BTCFG2_INSEL2_RCLP		选择RCLP做信号源
      BTIMx_BTCFG2_INSEL2_BT1_OUT	选择BT1的输出做信号源
输出: 无
*********************************/
void BTIMx_BTCFG2_INSEL2_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG2;
	tmpreg &= ~(BTIMx_BTCFG2_INSEL2_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG2_INSEL2_Msk);
	BTIMx->BTCFG2 = tmpreg;
}
/*********************************
basic timer 内部输入信号源2选择函数 
功能：获取BT 内部输入信号源2配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG2_INSEL2_UART_RX3	信号源为UART3接收信号
      BTIMx_BTCFG2_INSEL2_UART_RX4	信号源为UART4接收信号
      BTIMx_BTCFG2_INSEL2_UART_RX5	信号源为UART5接收信号
      BTIMx_BTCFG2_INSEL2_RCLP		信号源为RCLP做信号源
      BTIMx_BTCFG2_INSEL2_BT1_OUT	信号源为BT1的输出
*********************************/
uint32_t BTIMx_BTCFG2_INSEL2_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG2 & BTIMx_BTCFG2_INSEL2_Msk);
}
/*********************************
basic timer 内部输入信号源1选择函数 
功能：配置BT 内部输入信号源1
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTCFG2_INSEL1_UART_RX0	选择UART0接收信号做信号源
      BTIMx_BTCFG2_INSEL1_UART_RX1	选择UART1接收信号做信号源
      BTIMx_BTCFG2_INSEL1_UART_RX2	选择UART2接收信号做信号源
      BTIMx_BTCFG2_INSEL1_RCLP		选择RCLP做信号源
输出: 无
*********************************/
void BTIMx_BTCFG2_INSEL1_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTCFG2;
	tmpreg &= ~(BTIMx_BTCFG2_INSEL1_Msk);
	tmpreg |= (SetValue & BTIMx_BTCFG2_INSEL1_Msk);
	BTIMx->BTCFG2 = tmpreg;
}

