flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_btim.c
/*********************************
basic timer 内部输入信号源1选择函数 
功能：获取BT 内部输入信号源1配置
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTCFG2_INSEL1_UART_RX0	信号源为UART0接收信号
      BTIMx_BTCFG2_INSEL1_UART_RX1	信号源为UART1接收信号
      BTIMx_BTCFG2_INSEL1_UART_RX2	信号源为UART2接收信号
      BTIMx_BTCFG2_INSEL1_RCLP		信号源为RCLP做信号源
*********************************/
uint32_t BTIMx_BTCFG2_INSEL1_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCFG2 & BTIMx_BTCFG2_INSEL1_Msk);
}

/*********************************
basic timer group1输入预分频控制函数 
功能：配置BT group1预分频
输入: BTIM1/BTIM2  定时器名称
      具体分频值：00-FF，00表示1分频，FF表示256分频
输出: 无
*********************************/
void BTIMx_BTPRES_Write(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	BTIMx->BTPRES = (SetValue & BTIMx_BTPRES_PRESCALE_Msk);
}
/*********************************
basic timer group1输入预分频控制函数 
功能：获取BT group1预分频
输入: BTIM1/BTIM2  定时器名称
      
输出: 00-FF 00表示1分频，FF表示256分频
*********************************/
uint32_t BTIMx_BTPRES_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTPRES & BTIMx_BTPRES_PRESCALE_Msk);
}
/*********************************
basic timer group1加载控制函数 
功能：使能BT高位加载
输入: BTIM1/BTIM2  定时器名称
      ENABLE 高位加载启动
      DISABLE 高位加载停止
输出: 无
*********************************/
void BTIMx_BTLOADCR_LHEN_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTLOADCR |= (BTIMx_BTLOADCR_LHEN_Msk);
	}
	else
	{
		BTIMx->BTLOADCR &= ~(BTIMx_BTLOADCR_LHEN_Msk);
	}
}
/*********************************
basic timer group1加载控制函数 
功能：使能BT低位加载
输入: BTIM1/BTIM2  定时器名称
      ENABLE 低位加载启动
      DISABLE 低位加载停止
输出: 无
*********************************/
void BTIMx_BTLOADCR_LLEN_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTLOADCR |= (BTIMx_BTLOADCR_LLEN_Msk);
	}
	else
	{
		BTIMx->BTLOADCR &= ~(BTIMx_BTLOADCR_LLEN_Msk);
	}
}

/*********************************
basic timer 计数器计数值相关函数 
功能：读取计数器低位计数值
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF 具体计数值
*********************************/
uint32_t BTIMx_BTCNTL_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCNTL & BTIMx_BTCNTL_CNTL_Msk);
}

/*********************************
basic timer 计数器计数值相关函数 
功能：读取计数器高位计数值
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF 具体计数值
*********************************/
uint32_t BTIMx_BTCNTH_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCNTH & BTIMx_BTCNTH_CNTH_Msk);
}

/*********************************
basic timer 计数器预置数相关函数 
功能：配置计数器高位预置数
输入: BTIM1/BTIM2  定时器名称
      0000-FFFF  具体预置数值
*********************************/
void BTIMx_BTPRESET_PRESETH_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTPRESET;
	tmpreg &= ~(BTIMx_BTPRESET_PRESETH_Msk);
	tmpreg |= (SetValue & BTIMx_BTPRESET_PRESETH_Msk);
	BTIMx->BTPRESET = tmpreg;
}
/*********************************
basic timer 计数器预置数相关函数 
功能：读取计数器高位预置数
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF  具体预置数值
*********************************/
uint32_t BTIMx_BTPRESET_PRESETH_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTPRESET & BTIMx_BTPRESET_PRESETH_Msk);
}

/*********************************
basic timer 计数器预置数相关函数 
功能：配置计数器低位预置数
输入: BTIM1/BTIM2  定时器名称
      0000-FFFF  具体预置数值
*********************************/
void BTIMx_BTPRESET_PRESETL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTPRESET;
	tmpreg &= ~(BTIMx_BTPRESET_PRESETL_Msk);
	tmpreg |= (SetValue & BTIMx_BTPRESET_PRESETL_Msk);
	BTIMx->BTPRESET = tmpreg;
}

/*********************************
basic timer 计数器预置数相关函数 
功能：读取计数器低位预置数
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF  具体预置数值
*********************************/
uint32_t BTIMx_BTPRESET_PRESETL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTPRESET & BTIMx_BTPRESET_PRESETL_Msk);
}

/*********************************
basic timer 计数器加载数相关函数 
功能：配置计数器低位加载数
输入: BTIM1/BTIM2  定时器名称
      0000-FFFF  具体加载数值
*********************************/
void BTIMx_BTLOADL_Write(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	BTIMx->BTLOADL = (SetValue & BTIMx_BTLOADL_LOADL_Msk);
}
/*********************************
basic timer 计数器加载数相关函数 
功能：读取计数器低位加载数
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF  具体加载数值
*********************************/
uint32_t BTIMx_BTLOADL_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTLOADL & BTIMx_BTLOADL_LOADL_Msk);
}

/*********************************
basic timer 计数器加载数相关函数 
功能：配置计数器高位加载数
输入: BTIM1/BTIM2  定时器名称
      0000-FFFF  具体加载数值
*********************************/
void BTIMx_BTLOADH_Write(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	BTIMx->BTLOADH = (SetValue & BTIMx_BTLOADH_LOADH_Msk);
}
/*********************************
basic timer 计数器加载数相关函数 
功能：读取计数器高位加载数
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF  具体加载数值
*********************************/
uint32_t BTIMx_BTLOADH_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTLOADH & BTIMx_BTLOADH_LOADH_Msk);
}
/*********************************
basic timer 计数器比较值相关函数 
功能：配置计数器低位比较值
输入: BTIM1/BTIM2  定时器名称
      0000-FFFF  具体比较值
*********************************/
void BTIMx_BTCMPL_Write(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	BTIMx->BTCMPL = (SetValue & BTIMx_BTCMPL_CMPL_Msk);
}
/*********************************
basic timer 计数器比较值相关函数
功能：读取计数器低位比较值
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF  具体比较值
*********************************/
uint32_t BTIMx_BTCMPL_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCMPL & BTIMx_BTCMPL_CMPL_Msk);
}

/*********************************
basic timer 计数器比较值相关函数 
功能：配置计数器高位比较值
输入: BTIM1/BTIM2  定时器名称
      0000-FFFF  具体比较值
*********************************/
void BTIMx_BTCMPH_Write(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	BTIMx->BTCMPH = (SetValue & BTIMx_BTCMPH_CMPH_Msk);
}
/*********************************
basic timer 计数器比较值相关函数
功能：读取计数器高位比较值
输入: BTIM1/BTIM2  定时器名称
输出: 0000-FFFF  具体比较值
*********************************/
uint32_t BTIMx_BTCMPH_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTCMPH & BTIMx_BTCMPH_CMPH_Msk);
}

/*********************************
basic timer 计数器脉冲输出函数 
功能：配置计数器具体脉冲宽度
输入: BTIM1/BTIM2  定时器名称
      0000-0FFF    宽度为30.5*(1+SetValue)
*********************************/
void BTIMx_BTOUTCNT_Write(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	BTIMx->BTOUTCNT = (SetValue & BTIMx_BTOUTCNT_OUTCNT_Msk);
}
/*********************************
basic timer 计数器脉冲输出函数 
功能：读取计数器具体脉冲宽度定义
输入: BTIM1/BTIM2  定时器名称
输出: 0000-0FFF  具体宽度为30.5*(1+返回值)
*********************************/
uint32_t BTIMx_BTOUTCNT_Read(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTOUTCNT & BTIMx_BTOUTCNT_OUTCNT_Msk);
}

