flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_btim.c
/*********************************
basic timer 计数器输出控制函数 
功能：配置计数器输出是否清零
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTOCR_OUTCLR/BTIMx_BTOCR_OUTCLR_CLR		输出写入无效/输出清零(若设置了反向则输出高，未设置则输出低)
*********************************/
void BTIMx_BTOCR_OUTCLR_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTOCR;
	tmpreg &= ~(BTIMx_BTOCR_OUTCLR_Msk);
	tmpreg |= (SetValue & BTIMx_BTOCR_OUTCLR_Msk);
	BTIMx->BTOCR = tmpreg;
}
/*********************************
basic timer 计数器输出控制函数 
功能：获取计数器输出是否清零
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTOCR_OUTCLR/BTIMx_BTOCR_OUTCLR_CLR		输出写入无效/输出清零(若设置了反向则输出高，未设置则输出低)
*********************************/
uint32_t BTIMx_BTOCR_OUTCLR_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTOCR & BTIMx_BTOCR_OUTCLR_Msk);
}

/*********************************
basic timer 计数器输出控制函数 
功能：配置计数器输出电平
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTOCR_OUTINV_NOT_ANTI/BTIMx_BTOCR_OUTINV_ANTI	输出电平不取反/输出电平取反
*********************************/
void BTIMx_BTOCR_OUTINV_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTOCR;
	tmpreg &= ~(BTIMx_BTOCR_OUTINV_Msk);
	tmpreg |= (SetValue & BTIMx_BTOCR_OUTINV_Msk);
	BTIMx->BTOCR = tmpreg;
}
/*********************************
basic timer 计数器输出控制函数 
功能：获取计数器输出电平
输入: BTIM1/BTIM2  定时器名称
输出: 	BTIMx_BTOCR_OUTMOD_PULSE/BTIMx_BTOCR_OUTMOD_ANTI_LEVEL	输出电平不取反/输出电平取反
*********************************/
uint32_t BTIMx_BTOCR_OUTINV_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTOCR & BTIMx_BTOCR_OUTINV_Msk);
}

/*********************************
basic timer 计数器输出控制函数 
功能：配置计数器输出模式
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTOCR_OUTINV_NOT_ANTI/BTIMx_BTOCR_OUTINV_ANTI	输出脉冲，宽度可调/输出之前的反向电平
输出: 无
*********************************/   
void BTIMx_BTOCR_OUTMOD_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTOCR;
	tmpreg &= ~(BTIMx_BTOCR_OUTMOD_Msk);
	tmpreg |= (SetValue & BTIMx_BTOCR_OUTMOD_Msk);
	BTIMx->BTOCR = tmpreg;
}
/*********************************
basic timer 计数器输出控制函数 
功能：获取计数器输出模式
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTOCR_OUTINV_NOT_ANTI/BTIMx_BTOCR_OUTINV_ANTI	输出脉冲，宽度可调/输出之前的反向电平
*********************************/
uint32_t BTIMx_BTOCR_OUTMOD_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTOCR & BTIMx_BTOCR_OUTMOD_Msk);
}

/*********************************
basic timer 计数器输出控制函数 
功能：配置计数器输出信号源
输入: BTIM1/BTIM2  定时器名称
      BTIMx_BTOCR_OUTSEL_CMPH/		输出高位计数器比较信号，仅计数模式有效
      BTIMx_BTOCR_OUTSEL_CMPL/		输出低位计数器比较信号，仅计数模式有效
      BTIMx_BTOCR_OUTSEL_GROUP1/	输出Group1的输入信号，计数，捕捉模式有效	
      BTIMx_BTOCR_OUTSEL_GROUP2/	输出Group2的输入信号，计数，捕捉模式有效
      BTIMx_BTOCR_OUTSEL_PWM		PWM输出
输出: 无
*********************************/  
void BTIMx_BTOCR_OUTSEL_Set(BTIMx_Type* BTIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = BTIMx->BTOCR;
	tmpreg &= ~(BTIMx_BTOCR_OUTSEL_Msk);
	tmpreg |= (SetValue & BTIMx_BTOCR_OUTSEL_Msk);
	BTIMx->BTOCR = tmpreg;
}
/*********************************
basic timer 计数器输出控制函数 
功能：获取计数器输出信号源
输入: BTIM1/BTIM2  定时器名称
输出: BTIMx_BTOCR_OUTSEL_CMPH/		输出高位计数器比较信号，仅计数模式有效
      BTIMx_BTOCR_OUTSEL_CMPL/		输出低位计数器比较信号，仅计数模式有效
      BTIMx_BTOCR_OUTSEL_GROUP1/	输出Group1的输入信号，计数，捕捉模式有效	
      BTIMx_BTOCR_OUTSEL_GROUP2/	输出Group2的输入信号，计数，捕捉模式有效
      BTIMx_BTOCR_OUTSEL_PWM		PWM输出
*********************************/
uint32_t BTIMx_BTOCR_OUTSEL_Get(BTIMx_Type* BTIMx)
{
	return (BTIMx->BTOCR & BTIMx_BTOCR_OUTSEL_Msk);
}

/*********************************
basic timer计数器中断使能控制函数 
功能：使能BT高位比较发生信号
输入: BTIM1/BTIM2  定时器名称	 
      ENABLE/DISABLE 			高位比较发生信号中断使能/高位比较发生信号中断禁止
输出: 无
*********************************/
void BTIMx_BTIE_CMPHIE_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTIE |= (BTIMx_BTIE_CMPHIE_Msk);
	}
	else
	{
		BTIMx->BTIE &= ~(BTIMx_BTIE_CMPHIE_Msk);
	}
}
/*********************************
basic timer计数器中断使能控制函数 
功能：获取BT高位比较发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: ENABLE/DISABLE 			高位比较发生信号中断使能/高位比较发生信号中断禁止
*********************************/
FunState BTIMx_BTIE_CMPHIE_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIE & (BTIMx_BTIE_CMPHIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer计数器中断使能控制函数 
功能：使能BT低位比较发生信号
输入: BTIM1/BTIM2  定时器名称	 
      ENABLE/DISABLE 			低位比较发生信号中断使能/低位比较发生信号中断禁止
输出: 无
*********************************/
void BTIMx_BTIE_CMPLIE_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTIE |= (BTIMx_BTIE_CMPLIE_Msk);
	}
	else
	{
		BTIMx->BTIE &= ~(BTIMx_BTIE_CMPLIE_Msk);
	}
}
/*********************************
basic timer计数器中断使能控制函数 
功能：获取BT低位比较发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: ENABLE/DISABLE 			低位比较发生信号中断使能/低位比较发生信号中断禁止
*********************************/
FunState BTIMx_BTIE_CMPLIE_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIE & (BTIMx_BTIE_CMPLIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}
/*********************************
basic timer计数器中断使能控制函数 
功能：使能BT高位溢出发生信号
输入: BTIM1/BTIM2  定时器名称	 
      ENABLE/DISABLE 			高位溢出发生信号中断使能/高位溢出发生信号中断禁止
输出: 无
*********************************/
void BTIMx_BTIE_OVHIE_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTIE |= (BTIMx_BTIE_OVHIE_Msk);
	}
	else
	{
		BTIMx->BTIE &= ~(BTIMx_BTIE_OVHIE_Msk);
	}
}
/*********************************
basic timer计数器中断使能控制函数 
功能：获取BT高位溢出发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: ENABLE/DISABLE 			高位溢出发生信号中断使能/高位溢出发生信号中断禁止
*********************************/
FunState BTIMx_BTIE_OVHIE_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIE & (BTIMx_BTIE_OVHIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


/*********************************
basic timer计数器中断使能控制函数 
功能：使能BT低位溢出发生信号
输入: BTIM1/BTIM2  定时器名称	 
      ENABLE/DISABLE 			低位溢出发生信号中断使能/低位溢出发生信号中断禁止
输出: 无
*********************************/
void BTIMx_BTIE_OVLIE_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTIE |= (BTIMx_BTIE_OVLIE_Msk);
	}
	else
	{
		BTIMx->BTIE &= ~(BTIMx_BTIE_OVLIE_Msk);
	}
}
/*********************************
basic timer计数器中断使能控制函数 
功能：获取BT低位溢出发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: ENABLE/DISABLE 			低位溢出发生信号中断使能/低位溢出发生信号中断禁止
*********************************/
FunState BTIMx_BTIE_OVLIE_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIE & (BTIMx_BTIE_OVLIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


