flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_btim.c
/*********************************
basic timer计数器中断使能控制函数 
功能：使能BT捕捉发生信号
输入: BTIM1/BTIM2  定时器名称	 
      ENABLE/DISABLE 			捕捉发生信号中断使能/捕捉发生信号中断禁止
输出: 无
*********************************/
void BTIMx_BTIE_CAPIE_Setable(BTIMx_Type* BTIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		BTIMx->BTIE |= (BTIMx_BTIE_CAPIE_Msk);
	}
	else
	{
		BTIMx->BTIE &= ~(BTIMx_BTIE_CAPIE_Msk);
	}
}
/*********************************
basic timer计数器中断使能控制函数 
功能：获取BT捕捉发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: ENABLE/DISABLE 			捕捉发生信号中断使能/捕捉发生信号中断禁止
*********************************/
FunState BTIMx_BTIE_CAPIE_Getable(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIE & (BTIMx_BTIE_CAPIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
basic timer计数器中断信号函数 
功能：清BT计数器捕捉沿状态
输入: BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTIF_EDGESTA_Clr(BTIMx_Type* BTIMx)
{
	BTIMx->BTIF = BTIMx_BTIF_EDGESTA_Msk;
}
/*********************************
basic timer计数器中断信号函数 
功能：获取BT计数器捕捉沿状态
输入: BTIM1/BTIM2  定时器名称	 
输出: SET/RESET 			脉冲宽度捕捉模式时表示捕捉到下沿/脉冲宽度捕捉模式时表示捕捉到上沿
*********************************/
FlagStatus BTIMx_BTIF_EDGESTA_Chk(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIF & BTIMx_BTIF_EDGESTA_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
basic timer计数器中断信号函数 
功能：清BT计数器高位比较发生信号状态
输入: BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTIF_CMPHIF_Clr(BTIMx_Type* BTIMx)
{
	BTIMx->BTIF = BTIMx_BTIF_CMPHIF_Msk;
}
/*********************************
basic timer计数器中断信号函数 
功能：获取BT计数器高位比较发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: SET/RESET 			当前计数器的值大于等工作寄存器的值/当前计数器的值小于工作寄存器的值
*********************************/
FlagStatus BTIMx_BTIF_CMPHIF_Chk(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIF & BTIMx_BTIF_CMPHIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
basic timer计数器中断信号函数 
功能：清BT计数器低位比较发生信号状态
输入: BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTIF_CMPLIF_Clr(BTIMx_Type* BTIMx)
{
	BTIMx->BTIF = BTIMx_BTIF_CMPLIF_Msk;
}

/*********************************
basic timer计数器中断信号函数 
功能：获取BT计数器低位比较发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: SET/RESET 			当前计数器的值大于等工作寄存器的值/当前计数器的值小于工作寄存器的值
*********************************/
FlagStatus BTIMx_BTIF_CMPLIF_Chk(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIF & BTIMx_BTIF_CMPLIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
basic timer计数器中断信号函数 
功能：清BT计数器高位溢出发生信号状态
输入: BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTIF_OVHIF_Clr(BTIMx_Type* BTIMx)
{
	BTIMx->BTIF = BTIMx_BTIF_OVHIF_Msk;
}
/*********************************
basic timer计数器中断信号函数 
功能：获取BT计数器高位溢出发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: SET/RESET 			产生计数溢出/未产生溢出
*********************************/
FlagStatus BTIMx_BTIF_OVHIF_Chk(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIF & BTIMx_BTIF_OVHIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
basic timer计数器中断信号函数 
功能：清BT计数器低位溢出发生信号状态
输入: BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTIF_OVLIF_Clr(BTIMx_Type* BTIMx)
{
	BTIMx->BTIF = BTIMx_BTIF_OVLIF_Msk;
}
/*********************************
basic timer计数器中断信号函数 
功能：获取BT计数器低位溢出发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: SET/RESET 			产生计数溢出/未产生溢出
*********************************/
FlagStatus BTIMx_BTIF_OVLIF_Chk(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIF & BTIMx_BTIF_OVLIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}


/*********************************
basic timer计数器中断信号函数 
功能：清BT计数器捕捉发生信号状态
输入: BTIM1/BTIM2  定时器名称
输出: 无
*********************************/
void BTIMx_BTIF_CAPIF_Clr(BTIMx_Type* BTIMx)
{
	BTIMx->BTIF = BTIMx_BTIF_CAPIF_Msk;
}
/*********************************
basic timer计数器中断信号函数 
功能：获取BT计数器捕捉发生信号状态
输入: BTIM1/BTIM2  定时器名称	 
输出: SET/RESET 			捕捉到指定的沿/未捕捉到指定的沿
*********************************/
FlagStatus BTIMx_BTIF_CAPIF_Chk(BTIMx_Type* BTIMx)
{
	if (BTIMx->BTIF & BTIMx_BTIF_CAPIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
basic timer计数器定义函数 
功能：关闭BT计数器所有功能(缺省定义)
输入: BTIM1/BTIM2  定时器名称	 
输出: 无
*********************************/
void BTIMx_Deinit(BTIMx_Type* BTIMx)
{
	BTIMx->BTCR1 = 0x00000000;
	BTIMx->BTCR2 = 0x00000000;
	BTIMx->BTCFG1 = 0x00000000;
	BTIMx->BTCFG2 = 0x00000000;
	BTIMx->BTPRES = 0x00000000;
	BTIMx->BTLOADCR = 0x00000000;
	//BTIMx->BTCNTL = ;
	//BTIMx->BTCNTH = ;
	BTIMx->BTPRESET = 0x00000000;
	BTIMx->BTLOADL = 0x00000000;
	BTIMx->BTLOADH = 0x00000000;
	//BTIMx->BTCMPL = ;
	//BTIMx->BTCMPH = ;
	BTIMx->BTOUTCNT = 0x00000000;
	BTIMx->BTOCR = 0x00000000;
	BTIMx->BTIE = 0x00000000;
	//BTIMx->BTIF = ;
}
//Code_End



void BTIMx_Init(BTIMx_Type* BTIMx, BTIM_InitTypeDef* para)
{
	BTIMx_Deinit(BTIMx);

	//捕捉参数选择
	BTIMx_BTCR1_CAPMOD_Set(BTIMx, para->cap_para.CAPMOD);//捕捉模式控制，脉冲宽度或脉冲周期
	BTIMx_BTCR1_CAPCLR_Set(BTIMx, para->cap_para.CAPCLR);//捕捉是否需要清零计数器
	BTIMx_BTCR1_CAPONCE_Set(BTIMx, para->cap_para.CAPONCE);//捕捉是否单次捕捉

	//信号选择类
	BTIMx_BTCFG1_RTCSEL1_Set(BTIMx, para->sig_src_para.RTCSEL1);//选择RTCOUT1信号选择
	BTIMx_BTCFG1_RTCSEL2_Set(BTIMx, para->sig_src_para.RTCSEL2);//选择RTCOUT2信号选择
	BTIMx_BTCFG2_INSEL1_Set(BTIMx, para->sig_src_para.INSEL1);//选择内部输入信号1
	BTIMx_BTCFG2_INSEL2_Set(BTIMx, para->sig_src_para.INSEL2);//选择内部输入信号2
    BTIMx_BTCFG2_EXSEL1_Set(BTIMx, para->sig_src_para.EXSEL1);//选择外部输入信号1
    BTIMx_BTCFG2_EXSEL2_Set(BTIMx, para->sig_src_para.EXSEL2);//选择外部输入信号2
	
	
	BTIMx_BTCFG1_GRP1SEL_Set(BTIMx, para->sig_src_para.GRP1SEL);//选择GROUP1信号选择
	BTIMx_BTCFG1_GRP2SEL_Set(BTIMx, para->sig_src_para.GRP2SEL);//选择GROUP2信号选择
	
	BTIMx_BTCR2_SIG2SEL_Set(BTIMx, para->sig_src_para.CNTSRC);//选择内部计数源信号
	BTIMx_BTCR2_SIG1SEL_Set(BTIMx, para->sig_src_para.CAPSRC);//选择内部捕捉源信号

	BTIMx_BTCR2_CNTHSEL_Set(BTIMx, para->sig_src_para.CNTHSEL);//高位计数器计数源选择
	BTIMx_BTCR2_SRCSEL_Set(BTIMx, para->sig_src_para.SRCSEL);//选择低位计数器是否长使能

	//DIR控制类
	BTIMx_BTCR2_DIREN_Setable(BTIMx, para->dir_para.DIREN);//外部dir控制或不使能
	//BTIMx_BTCR2_STDIR_Setable(BTIMx, para->dir_para.STDIR);//内部dir控制信号，这个应该不需要
	BTIMx_BTCR2_DIRPO_Set(BTIMx, para->dir_para.DIRPO);//外部输入dir信号极性选择


	//控制类参数
	BTIMx_BTCR1_MODE_Set(BTIMx, para->ctrl_para.MODE);//工作模式，16位捕捉还是8位定时计数
	BTIMx_BTCR1_EDGESEL_Set(BTIMx, para->ctrl_para.EDGESEL);//沿选择，上升沿还是下降沿
	BTIMx_BTPRES_Write(BTIMx, para->ctrl_para.PRESCALE);//选择分频系数

	BTIMx_BTPRESET_PRESETH_Set(BTIMx, para->ctrl_para.PRESETH);//高位预加载值
	BTIMx_BTPRESET_PRESETL_Set(BTIMx, para->ctrl_para.PRESETL);//低位预加载值

	BTIMx_BTLOADH_Write(BTIMx, para->ctrl_para.LOADH);//高位加载值
	BTIMx_BTLOADL_Write(BTIMx, para->ctrl_para.LOADL);//低位加载值
	
	//输出类参数
	BTIMx_BTOCR_OUTMOD_Set(BTIMx, para->out_para.OUTMOD);//输出模式选择
	BTIMx_BTOCR_OUTSEL_Set(BTIMx, para->out_para.OUTSEL);//输出信号选择
	BTIMx_BTOUTCNT_Write(BTIMx, para->out_para.OUTCNT);//输出脉冲宽度设置
	BTIMx_BTOCR_OUTINV_Set(BTIMx, para->out_para.OUTINV);//输出电平反向选择
	
}


